
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 7 to add, 9 to change, 6 to destroy.</code></pre>

* Create
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]
* Update
  * azurerm_key_vault_secret.app_insights_connection_string
  * azurerm_key_vault_secret.create_updates_queue_listen_conn_str
  * azurerm_key_vault_secret.create_updates_queue_send_conn_str
  * azurerm_key_vault_secret.update_case_queue_send_conn_str
  * azurerm_resource_group.rg
  * module.application_insights.azurerm_application_insights.this
  * module.et-key-vault.azurerm_key_vault.kv
  * module.et-key-vault.azurerm_user_assigned_identity.managed_identity[0]
  * module.servicebus-namespace-ret3725.azurerm_servicebus_namespace.servicebus_namespace
* Replace
  * module.create-updates-queue-ret3725.azurerm_servicebus_queue.servicebus_queue
  * module.create-updates-queue-ret3725.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.create-updates-queue-ret3725.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.update-case-queue-ret3725.azurerm_servicebus_queue.servicebus_queue
  * module.update-case-queue-ret3725.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.update-case-queue-ret3725.azurerm_servicebus_queue_authorization_rule.send_auth_rule
* Move
  * azurerm_application_insights.appinsights => module.application_insights.azurerm_application_insights.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.app_insights_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_connection_string" {
        id                      = "https://et-prod.vault.azure.net/secrets/app-insights-connection-string/21b737d1b4cd4fb39beb26dbd357c72b"
        name                    = "app-insights-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.create_updates_queue_listen_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "create_updates_queue_listen_conn_str" {
        id                      = "https://et-prod.vault.azure.net/secrets/create-updates-queue-listen-connection-string/c4b704acce4440549002eedc64a9789e"
        name                    = "create-updates-queue-listen-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.create_updates_queue_send_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "create_updates_queue_send_conn_str" {
        id                      = "https://et-prod.vault.azure.net/secrets/create-updates-queue-send-connection-string/e768b7c9735d45fc838c2f616da56d53"
        name                    = "create-updates-queue-send-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.update_case_queue_send_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "update_case_queue_send_conn_str" {
        id                      = "https://et-prod.vault.azure.net/secrets/update-case-queue-send-connection-string/00b239c556d245918a33b511cf1f7d74"
        name                    = "update-case-queue-send-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod"
        name       = "et-prod"
      ~ tags       = {
            "application"         = "employment-tribunals"
            "builtFrom"           = "https://github.com/HMCTS/et-shared-infrastructure.git"
            "businessArea"        = "CFT"
          ~ "contactSlackChannel" = "#et-tech" -> "#et-developers"
            "environment"         = "production"
            "managedBy"           = "Employment Tribunals"
        }
        # (2 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_application_insights.this will be updated in-place
  # (moved from azurerm_application_insights.appinsights)
  ~ resource "azurerm_application_insights" "this" {
      ~ daily_data_cap_in_gb                  = 100 -> 50
      ~ daily_data_cap_notifications_disabled = false -> true
        id                                    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.Insights/components/et-prod"
        name                                  = "et-prod"
      ~ tags                                  = {
            "application"         = "employment-tribunals"
            "builtFrom"           = "https://github.com/HMCTS/et-shared-infrastructure.git"
            "businessArea"        = "CFT"
          ~ "contactSlackChannel" = "#et-tech" -> "#et-developers"
            "environment"         = "production"
            "managedBy"           = "Employment Tribunals"
        }
        # (14 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be created
  + resource "azurerm_monitor_activity_log_alert" "main" {
      + description         = "Monitors for application insight reaching it's daily cap."
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "Application Insights daily cap reached - et-prod"
      + resource_group_name = "et-prod"
      + scopes              = [
          + "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.Insights/components/et-prod",
        ]
      + tags                = {
          + "application"         = "employment-tribunals"
          + "builtFrom"           = "https://github.com/HMCTS/et-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#et-developers"
          + "environment"         = "production"
          + "managedBy"           = "Employment Tribunals"
        }

      + action {
          + action_group_id    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
          + webhook_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = "C05URPSN326"
            }
        }

      + criteria {
          + category       = "Administrative"
          + level          = "Warning"
          + operation_name = "Microsoft.Insights/Components/DailyCapReached/Action"
          + resource_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.Insights/components/et-prod"

          + resource_health (known after apply)

          + service_health (known after apply)
        }
    }

  # module.create-updates-queue-ret3725.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "et-sb-prod"
      + premium_messaging_partitions        = (known after apply)
      + resource_group_name                 = "et-prod"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
      + zone_redundant                      = (known after apply)
    }

  # module.create-updates-queue-ret3725.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.ServiceBus/namespaces/et-sb-prod/queues/create-updates" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 1024 -> (known after apply)
        name                                    = "create-updates"
      ~ namespace_id                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.ServiceBus/namespaces/et-sb-prod" # forces replacement -> (known after apply) # forces replacement
        # (15 unchanged attributes hidden)
    }

  # module.create-updates-queue-ret3725.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.ServiceBus/namespaces/et-sb-prod/queues/create-updates/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.ServiceBus/namespaces/et-sb-prod/queues/create-updates" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.create-updates-queue-ret3725.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.ServiceBus/namespaces/et-sb-prod/queues/create-updates/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.ServiceBus/namespaces/et-sb-prod/queues/create-updates" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.et-key-vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.KeyVault/vaults/et-prod"
        name                            = "et-prod"
      ~ tags                            = {
            "application"         = "employment-tribunals"
            "builtFrom"           = "https://github.com/HMCTS/et-shared-infrastructure.git"
            "businessArea"        = "CFT"
          ~ "contactSlackChannel" = "#et-tech" -> "#et-developers"
            "environment"         = "production"
            "managedBy"           = "Employment Tribunals"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.et-key-vault.azurerm_user_assigned_identity.managed_identity[0] will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "managed_identity" {
        id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/managed-identities-prod-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/et-prod-mi"
        name                = "et-prod-mi"
      ~ tags                = {
            "application"         = "employment-tribunals"
            "builtFrom"           = "https://github.com/HMCTS/et-shared-infrastructure.git"
            "businessArea"        = "CFT"
          ~ "contactSlackChannel" = "#et-tech" -> "#et-developers"
            "environment"         = "production"
            "managedBy"           = "Employment Tribunals"
        }
        # (5 unchanged attributes hidden)
    }

  # module.servicebus-namespace-ret3725.azurerm_servicebus_namespace.servicebus_namespace will be updated in-place
  ~ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
        id                                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.ServiceBus/namespaces/et-sb-prod"
        name                                = "et-sb-prod"
      ~ tags                                = {
            "application"         = "employment-tribunals"
            "builtFrom"           = "https://github.com/HMCTS/et-shared-infrastructure.git"
            "businessArea"        = "CFT"
          ~ "contactSlackChannel" = "#et-tech" -> "#et-developers"
            "environment"         = "production"
            "managedBy"           = "Employment Tribunals"
        }
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.update-case-queue-ret3725.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "et-sb-prod"
      + premium_messaging_partitions        = (known after apply)
      + resource_group_name                 = "et-prod"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
      + zone_redundant                      = (known after apply)
    }

  # module.update-case-queue-ret3725.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.ServiceBus/namespaces/et-sb-prod/queues/update-case" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 1024 -> (known after apply)
        name                                    = "update-case"
      ~ namespace_id                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.ServiceBus/namespaces/et-sb-prod" # forces replacement -> (known after apply) # forces replacement
        # (15 unchanged attributes hidden)
    }

  # module.update-case-queue-ret3725.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.ServiceBus/namespaces/et-sb-prod/queues/update-case/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.ServiceBus/namespaces/et-sb-prod/queues/update-case" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.update-case-queue-ret3725.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.ServiceBus/namespaces/et-sb-prod/queues/update-case/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.ServiceBus/namespaces/et-sb-prod/queues/update-case" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

Plan: 7 to add, 9 to change, 6 to destroy.

Changes to Outputs:
  ~ create_updates_queue_primary_listen_connection_string = (sensitive value)
  ~ create_updates_queue_primary_send_connection_string   = (sensitive value)
  ~ update_case_queue_primary_listen_connection_string    = (sensitive value)
  ~ update_case_queue_primary_send_connection_string      = (sensitive value)
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.application_insights.azurerm_application_insights.this has changed
  # (moved from azurerm_application_insights.appinsights)
  ~ resource "azurerm_application_insights" "this" {
      ~ connection_string                     = (sensitive value)
        id                                    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.Insights/components/et-prod"
        name                                  = "et-prod"
        tags                                  = {
            "application"         = "employment-tribunals"
            "builtFrom"           = "https://github.com/HMCTS/et-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#et-tech"
            "environment"         = "production"
            "managedBy"           = "Employment Tribunals"
        }
        # (15 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":88,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->